#include <stdio.h>


int main() {
    // Створюємо масив 3х5
    int s[3][5] = {
        { 1, -77, 63, -22,  165},
        { 6,  -7, 28,  17,  20},
        {-11,-12, 13,  6,  -155}
    };

    // Створюємо вектор
    int d[5] ;

    // Заповнення вектора d найбільшими негативними елементами відповідних стовпчиків
    for (int j = 0; j < 5; j++) {
        int max = 0;  // задаємо початкове значення для найбільшого відємного числа, якщо відємного числа немаж виведе 0

        for (int i = 0; i < 3; i++) {
            if (s[i][j] < max) {
                max = s[i][j];
            }
        }
        d[j] = max; //записужмо в вектор значення max яке дорівнюж наймеше відємне значення кожного стовпця
    }

    // Виведення вектора d
    printf("Vector d:\n");
    for (int j = 0; j < 5; j++) {
        printf("%3d ", d[j]);
    }

    return 0;
}